cf/Tasks/ЗадачаПользователю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Task>
		<Properties>
			<Name>ЗадачаПользователю</Name>
			<Addressing>InformationRegister.РолиПользователей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параллельная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cf/InformationRegisters/СтатусыБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусыБП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПользователю</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЗадачаРазработчику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Tasks/ЗадачаПользователю/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// Зполним заказ
	
	Если Заказ = Неопределено Тогда
		ИмяБП = БизнесПроцесс.Метаданные().Имя;
		
		Если ИмяБП = "ПеремещениеТоваров" Тогда	
			Заказ = БизнесПроцесс.Заказчик.Заказ;
			
		ИначеЕсли ИмяБП = "ЗаявкаПокупателя" Или ИмяБП = "СборкаЗаказа" Или ИмяБП = "ИнтернетЗаявка" ИЛИ ИмяБП = "СогласованиеЗаказаПоставщику" Тогда
			Заказ = БизнесПроцесс.Заказ;
			
		ИначеЕсли ИмяБП = "РемонтИнструмента" Тогда
			Заказ = БизнесПроцесс.ЗаказНаряд; КонецЕсли; КонецЕсли;
	
КонецПроцедуры

Процедура ПередВыполнением(Отказ)
	
	Перем КонтрольАдресации;

	Если НЕ ДополнительныеСвойства.Свойство("КонтрольАдресации", КонтрольАдресации) Тогда
		КонтрольАдресации = Истина;
	КонецЕсли;
	
	Если 	КонтрольАдресации И
			Не КэшируемыеФункции.ЭтоПолныеПрава() И
			Не РольДоступна("ВыполнятьЛюбуюЗадачу") И
			Не ФункцииБизнесПроцессов.РазрешенаЗадачаКВыполнению(ЭтотОбъект) Тогда
		
		ОбщиеФункции.СообщитьТекст("Вам запрещено выполнять задачу
				|проверте на соответствие назначения задачи по исполнителю (кнопка ""адресация заадачи""");
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		Исполнитель 	= ПараметрыСеанса.ТекущийПользователь;
		ДатаВыполнения 	= ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Запишем статус БП
	
	Если 	ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗадачаРазработчику") И
			Выполнена = Ложь Тогда
		
		// Проверим есть ли старше
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1 Истина 
		|ИЗ 		Задача.ЗадачаПользователю 
		|
		|ГДЕ 		БизнесПроцесс 	= &БизнесПроцесс И 
		|			Выполнена 		= Ложь И
		|			ПометкаУдаления = Ложь И
		|			Дата > &Дата
		|");
		
		Запрос.УстановитьПараметр("БизнесПроцесс", 	БизнесПроцесс);
		Запрос.УстановитьПараметр("Дата", 			Дата);
		
		Если Запрос.Выполнить().Пустой() Тогда
		
			// Запишем
			
			Запись = РегистрыСведений.СтатусыБП.СоздатьМенеджерЗаписи();
			Запись.Статус 			= Ссылка;
			Запись.БизнесПроцесс 	= БизнесПроцесс;
			
			Попытка
				Запись.Записать();
			Исключение
				ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
				Отказ = Истина;
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	// Проверим что нужно бы напомнить
	
	Если 	ЭтотОбъект.ТочкаМаршрута <> БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.СборкаЗаказа И
			//ЭтотОбъект.ТочкаМаршрута <> БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.Переместить И
			//ЭтотОбъект.ТочкаМаршрута <> БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ПереместитьКогдаСобран И
			ЭтотОбъект.ТочкаМаршрута <> БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.СборкаЗаказа Тогда
			
		Если Выполнена Тогда
			
			Если Не НапоминанияСервер.УдалитьНапоминаниеПоИсточнику(Ссылка) Тогда
				Отказ = Истина;
			КонецЕсли;
			
		Иначе
			
			НапоминанияСервер.УстановитьНапоминание(
				Новый Структура("Склад, Роль, Пользователь",
								Склад, Роль, Пользователь),
				Ссылка,
				"Вам назначена задача:
				|" + Наименование);
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Установим паралелльность (медлено но куда деыацо, торплюсь я)
	
	Если ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.СборкаЗаказа") Тогда
		
		Задачи.ЗадачаПользователю.УстановитьФлагПараллельныхЗадач(БизнесПроцесс,,Ссылка);
		
	ИначеЕсли ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.ПеремещениеТоваров") Тогда
		
		Задачи.ЗадачаПользователю.УстановитьФлагПараллельныхЗадач(БизнесПроцесс.Заказчик,,Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры
